---
kind: method
id: M:Autodesk.Revit.DB.ColorFillScheme.CanDefineByRange
source: html/f4592c9f-40f1-703c-21e7-17bb7c2f3747.htm
---
# Autodesk.Revit.DB.ColorFillScheme.CanDefineByRange Method

Checks whether the scheme entries can be explained by range.

## Syntax (C#)
```csharp
public bool CanDefineByRange()
```

## Returns
Returns true ifthe scheme entries can be explained by range, false otherwise.